web/contactsSoap/deleteUser.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:ns1="${namespace}">
    <env:Header/>
    <env:Body>
        <ns1:deleteUser>
            <id>${args.0}</id>
        </ns1:deleteUser>
    </env:Body>
</env:Envelope>